# IsPeriodic Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HermiteSpline..::..IsPeriodic Property
HermiteSpline Class See Also
---
Returns whether the Hermite spline is periodic or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsPeriodic { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPeriodic As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPeriodic {
	bool get ();
}
```

# See Also
HermiteSpline Class
Autodesk.Revit.DB Namespace